local AddOnName, Engine = ...
local E, L, V, P, G = unpack(Engine); --Import: Engine, Locales, PrivateDB, ProfileDB, GlobalDB

-- Separator characters
local sep_chars = "%s-_,.<>%*)(/#+&x*"

-- Whitespace separator
local sep = "[" .. sep_chars .. "]";

-- Kleene closure of sep.
local csep = sep .. "*";

-- Positive closure of sep.
-- local psep = sep.."+";

E.Patterns.ILVL = {
	-- "2[0-9]{2}%+",
	-- "2[0-9]{2}",
	" [2-3][0-9][0-9]",

}

E.Patterns.Roles = {
	dd = {
		'[0-9]*' .. csep .. 'dps',
		'[0-9]*' .. csep .. 'дд/рдд',
		'[0-9]*' .. csep .. 'д/рдд',
		'[0-9]*' .. csep .. 'р/дд',
		'[0-9]*' .. csep .. 'Р/дд',
		-- '[0-9]*'..csep..'%+',
		'р/дд',
		'тащера',
		'животных',
		'мутанты',
		'сильнейших' .. csep .. 'дд',
		'топовых' .. csep .. 'дд',

		-- melee dps
		'[0-9]*' .. csep .. 'дд',
		'[0-9]' .. csep .. 'дд',
		'[0-9]*' .. csep .. 'адк',
		'[0-9]*' .. csep .. 'фвар', 'фурик',
		'[0-9]*' .. csep .. 'кот',
		'[0-9]*' .. csep .. 'рога', 'крога', 'комбат',
		'[0-9]*' .. csep .. 'ретрик',

		-- ranged dps
		'[0-9]*' .. csep .. 'рдд',
		'[0-9]' .. csep .. 'рдд',
		'[0-9]*' .. csep .. 'спд',
		'[0-9]*' .. csep .. 'шп',
		'кастеры',
		'кастер',
		'[0-9]*' .. csep .. 'сова',
		'[0-9]*' .. csep .. 'демон',
		'[0-9]*' .. csep .. 'элем',
		'[0-9]*' .. csep .. 'маг',
		'[0-9]*' .. csep .. 'тело',
		'[0-9]*' .. csep .. 'тела',
		'дд',
		-- 'пару',
		'р%(дд%)',
		'кольчужники',
		'ткань',
		'латники',
		'дпс',
		'дпс+',
		'дпс++',
		'пару' .. csep .. 'дд',
		'дд' .. csep .. 'рдд',
		'дд%.рдд',
		'дд%/рдд',
		'пару' .. csep .. 'рдд',
		'пара' .. csep .. 'рдд',
		'пара' .. csep .. 'дд',
	},
	heal = {
		'[0-9]*' .. csep .. 'хил',
		'[0-9]*' .. csep .. 'хилов',
		'[0-9]*' .. csep .. 'hll',
		'[0-9]*' .. csep .. 'рдру',
		'[0-9]*' .. csep .. 'ршам',
		'[0-9]*' .. csep .. 'хпал',
		'[0-9]*' .. csep .. 'дц', 'дц',
		'[0-9]*' .. csep .. 'хприст',
		'[0-9]*' .. csep .. 'прист',
		'хил',
		'солохил',
		'хилл',
	},
	tank = {
		'[0-9]*' .. csep .. 'танк', '[0-9]' .. csep .. 'танка',
		'[0-9]*' .. csep .. 'танка', 'танки', 'танк',
		'пару' .. csep .. 'танков',
		'[0-9]*' .. csep .. 'ппал', 'протопал',
		'[0-9]*' .. csep .. 'пвар', 'протовар',
		'[0-9]*' .. csep .. 'мт/от', '[0-9]* от',
		"танчик",
		'дк' .. csep .. 'танк', '[0-9]*' .. csep .. 'танк' .. csep .. 'дк',
	},
}